"SPC Password" = "كلمة سر SPC";
"Authentication Key" = "مفتاح المصادقة";
"Incorrect key" = "مفتاح غير صحيح";
"Incorrect SPC Password" = "كلمة سر SPC غير صحيحة";
"Enter 26 digit key" = "قم بإدخال ٢٦ رقم لمفتاح المصادقة.";
"Security" = "الأمان";
"Too many retries of SPC." = "يوجد عدد كبير للمحاولات لـ SPC.";
"AKEY set successfully." = "تمت إعداد AKEY بنجاح.";
"Failed to set AKEY." = "فشل إعداد AKEY.";
"Too many retries of AKEY." = "يوجد عدد كبير للمحاولات لـ AKEY.";
"Password" = "كلمة السر";
"Key" = "المفتاح";
"OK" = "موافق";
"Cancel" = "إلغاء";